-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2020 年 11 月 11 日 09:57
-- 伺服器版本： 10.4.13-MariaDB
-- PHP 版本： 7.2.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mytest0819`
--

-- --------------------------------------------------------

--
-- 資料表結構 `rating`
--

CREATE TABLE `rating` (
  `sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `skin_type` varchar(11) NOT NULL,
  `skin` int(11) NOT NULL,
  `rating` int(11) DEFAULT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `review` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `rating`
--

INSERT INTO `rating` (`sid`, `product_sid`, `name`, `email`, `skin_type`, `skin`, `rating`, `title`, `review`, `date`) VALUES
(1, 1, '馬林', 'test01@gmail.com', '乾性', 3, 5, '好用！', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝油的試用包都不會開封，因為真的很不習慣油油的感覺，最近用了順其自然卸妝油的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配活萃洗面乳，感受很棒，大概接下來１０年都會這麼使用綠藤的卸妝洗臉產品，激推！', '2020-11-03 00:00:00'),
(2, 1, 'Maureen', 'jerry@gmail.com', '混合肌', 2, 5, '比想像中厲害', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但綠藤的產品，使用後皮膚不油膩，也不乾澀，和之前使用的經驗很不一樣，還會繼續使用綠藤卸妝油', '2020-11-03 00:00:00'),
(3, 1, 'Jimmy', 'Jimmy@gmail.com', '油性', 1, 5, '讓人安心的卸妝油', '天然的卸妝油讓人用的更安心\r\n使用後肌膚保濕無負擔 完全無過敏反應\r\n肌膚有種被呵護的感覺\r\n已成為生活中不可或缺的單品', '2020-11-03 00:00:00'),
(4, 1, 'ruby', 'ruby@gmail.com', '混合肌', 2, 5, '成分天然是最吸引我的地方', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', '2020-11-03 00:00:00'),
(5, 1, 'Tom', 'Tom@gmail.com', '油性', 1, 5, '混合偏油也可以使用的卸妝乳', '一般卸妝的清潔力通常比較好，但對混合偏油肌的我來說非常容易造成毛孔堵塞形成粉刺或毛囊炎。但這款卸妝油使用時清爽舒適，容易洗淨；使用後毛孔呼吸很乾淨～！油肌福星～', '2020-11-03 00:00:00'),
(6, 1, 'Allen', 'Allen@gmail.com', '乾性', 3, 5, '天然ㄟ尚好', '總是困擾於找不到適合的卸妝產品，這瓶卸妝乳，出乎意料的好用，能夠把臉上的彩妝輕鬆的卸除，再搭艸艸洗面乳，完美清潔，不會讓肌膚造成負擔，屬於超敏感肌的我，終於找到適合的卸妝產品，放心的使用了，開心', '2020-11-03 00:00:00'),
(7, 1, 'Robin', 'Robin@gmail.com', '混合肌', 2, 5, '會回購', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝乳的試用包都不會開封，最近用了順其自然卸妝乳的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配艸艸洗面乳，感受很棒，大概接下來１０年都會這麼使用綠藤的卸妝洗臉產品，激推！', '2020-11-03 00:00:00'),
(8, 1, '威廉', 'wii@gmail.com', '油性', 1, 5, '很好用', '針對日常淡妝好卸，卸完後肌膚覺得很舒服，已經使用好幾瓶了！', '2020-11-03 00:00:00'),
(9, 1, 'Chia', 'malin@gmail.com', '混合肌', 2, 5, '推推', '可以將彩妝卸得很乾淨,又不會使肌膚乾澀', '2020-11-03 00:00:00'),
(10, 1, 'ruby', 'ruby@gmail.com', '混合肌', 2, 5, '成分天然是最吸引我的地方', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', '2020-11-03 00:00:00'),
(11, 1, 'Tom', 'Tom@gmail.com', '油性', 1, 5, '混合偏油也可以使用的卸妝乳', '一般卸妝的清潔力通常比較好，但對混合偏油肌的我來說非常容易造成毛孔堵塞形成粉刺或毛囊炎。但這款卸妝油使用時清爽舒適，容易洗淨；使用後毛孔呼吸很乾淨～！油肌福星～', '2020-11-03 00:00:00'),
(12, 1, 'Allen', 'Allen@gmail.com', '乾性', 3, 5, '天然ㄟ尚好', '總是困擾於找不到適合的卸妝產品，這瓶卸妝乳，出乎意料的好用，能夠把臉上的彩妝輕鬆的卸除，再搭艸艸洗面乳，完美清潔，不會讓肌膚造成負擔，屬於超敏感肌的我，終於找到適合的卸妝產品，放心的使用了，開心', '2020-11-03 00:00:00'),
(13, 1, 'Robin', 'Robin@gmail.com', '混合肌', 2, 5, '會回購', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝乳的試用包都不會開封，最近用了順其自然卸妝乳的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配艸艸洗面乳，感受很棒，大概接下來１０年都會這麼使用艸艸的卸妝洗臉產品，激推！', '2020-11-03 00:00:00'),
(14, 1, '威廉', 'wii@gmail.com', '油性', 1, 5, '很好用', '針對日常淡妝好卸，卸完後肌膚覺得很舒服，已經使用好幾瓶了！', '2020-11-03 00:00:00'),
(15, 1, 'Mia', 'Mia@gmail.com', '混合肌', 2, 5, '喜歡', '用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜～', '2020-11-03 00:00:00'),
(16, 1, '安安', 'anan@gmail.com', '乾性', 3, 5, '比想像中厲害', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，和之前使用的經驗很不一樣，還會繼續使用艸艸卸妝油', '2020-11-03 00:00:00'),
(17, 1, '佳宜', 'jerry@gmail.com', '混合肌', 2, 5, '很好用', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜', '2020-11-03 00:00:00'),
(18, 1, '小花', 'jerry@gmail.com', '油性', 1, 5, '會回購', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜', '2020-11-03 00:00:00'),
(19, 1, 'ruby', 'ruby@gmail.com', '混合肌', 2, 5, '成分天然是最吸引我的地方', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', '2020-11-03 00:00:00'),
(20, 1, 'Tom', 'Tom@gmail.com', '油性', 1, 5, '混合偏油也可以使用的卸妝乳', '一般卸妝的清潔力通常比較好，但對混合偏油肌的我來說非常容易造成毛孔堵塞形成粉刺或毛囊炎。但這款卸妝油使用時清爽舒適，容易洗淨；使用後毛孔呼吸很乾淨～！油肌福星～', '2020-11-03 00:00:00'),
(21, 1, 'Allen', 'Allen@gmail.com', '乾性', 3, 5, '天然ㄟ尚好', '總是困擾於找不到適合的卸妝產品，這瓶卸妝乳，出乎意料的好用，能夠把臉上的彩妝輕鬆的卸除，再搭艸艸洗面乳，完美清潔，不會讓肌膚造成負擔，屬於超敏感肌的我，終於找到適合的卸妝產品，放心的使用了，開心', '2020-11-03 00:00:00'),
(22, 1, 'Robin', 'Robin@gmail.com', '混合肌', 2, 5, '會回購', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝乳的試用包都不會開封，最近用了順其自然卸妝乳的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配艸艸洗面乳，感受很棒，大概接下來１０年都會這麼使用艸艸的卸妝洗臉產品，激推！', '2020-11-03 00:00:00'),
(23, 1, '威廉', 'wii@gmail.com', '油性', 1, 5, '很好用', '針對日常淡妝好卸，卸完後肌膚覺得很舒服，已經使用好幾瓶了！', '2020-11-03 00:00:00'),
(24, 1, 'Mia', 'Mia@gmail.com', '混合肌', 2, 5, '喜歡', '用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜～', '2020-11-03 00:00:00'),
(25, 1, '安安', 'anan@gmail.com', '乾性', 3, 5, '比想像中厲害', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，和之前使用的經驗很不一樣，還會繼續使用艸艸卸妝油', '2020-11-03 00:00:00'),
(26, 1, 'Jerry', 'jerry@gmail.com', '混合肌', 2, 5, '經濟實惠又好用\r\n', '經濟實惠又好用\r\n', '2020-11-03 00:00:00'),
(27, 1, 'Moomin', 'jerry@gmail.com', '油性', 1, 5, '會回購', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', '2020-11-03 00:00:00'),
(28, 1, 'ruby', 'ruby@gmail.com', '混合肌', 2, 5, '成分天然是最吸引我的地方', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', '2020-11-03 00:00:00'),
(29, 1, 'Tom', 'Tom@gmail.com', '油性', 1, 4, '混合偏油也可以使用的卸妝乳', '一般卸妝的清潔力通常比較好，但對混合偏油肌的我來說非常容易造成毛孔堵塞形成粉刺或毛囊炎。但這款卸妝油使用時清爽舒適，容易洗淨；使用後毛孔呼吸很乾淨～！油肌福星～', '2020-11-03 00:00:00'),
(30, 1, 'Allen', 'Allen@gmail.com', '乾性', 3, 5, '天然ㄟ尚好', '總是困擾於找不到適合的卸妝產品，這瓶卸妝乳，出乎意料的好用，能夠把臉上的彩妝輕鬆的卸除，再搭艸艸洗面乳，完美清潔，不會讓肌膚造成負擔，屬於超敏感肌的我，終於找到適合的卸妝產品，放心的使用了，開心', '2020-11-03 00:00:00'),
(31, 1, 'Robin', 'Robin@gmail.com', '混合肌', 2, 5, '超級喜歡', '使用後肌膚保濕無負擔 完全無過敏反應', '2020-11-03 00:00:00'),
(32, 1, '威廉', 'wii@gmail.com', '油性', 1, 4, '成分天然超安心', '針對日常淡妝好卸，卸完後肌膚覺得很舒服，已經使用好幾瓶了！', '2020-11-03 00:00:00'),
(33, 1, 'Mia', 'Mia@gmail.com', '混合肌', 2, 4, '經濟實惠', '用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜～', '2020-11-03 00:00:00'),
(34, 1, 'Jimmy', 'anan@gmail.com', '乾性', 3, 4, '成分天然是最吸引我的地方', '天然的成分讓人用的更安心\r\n使用後肌膚保濕無負擔 完全無過敏反應\r\n肌膚有種被呵護的感覺\r\n已成為生活中不可或缺的單品', '2020-11-03 00:00:00'),
(35, 1, '馬林', 'jerry@gmail.com', '混合肌', 2, 5, '很好用', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜', '2020-11-03 00:00:00'),
(36, 1, '瑄瑄', 'jerry@gmail.com', '油性', 1, 5, 'ＣＰ值很高', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝油的試用包都不會開封，因為真的很不習慣油油的感覺，最近用了順其自然卸妝油的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配活萃洗面乳，感受很棒，大概接下來１０年都會這麼使用綠藤的卸妝洗臉產品，激推！', '2020-11-03 00:00:00'),
(37, 1, 'Bunny', 'jerry@gmail.com', '油性', 1, 2, '不喜歡\r\n', '不喜歡\r\n', '2020-11-10 16:07:01'),
(38, 1, '1', '1', '1', 1, 1, '1', '1', '0000-00-00 00:00:00'),
(39, 1, '1', '1', '1', 1, 1, '1', '1', '0000-00-00 00:00:00'),
(40, 2, '2', '2', '2', 2, 2, '2', '2', '2020-11-10 22:08:38'),
(41, 2, '2', '2', '2', 2, 2, '2', '2', '2020-11-10 22:10:21'),
(42, 1, '11', '12', '1', 2, 3, '1212', '1221212', '2020-11-11 02:00:04'),
(43, 1, 'ee', 'ee', '1', 2, 3, 'ee', 'ee', '2020-11-11 08:55:26');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `rating`
--
ALTER TABLE `rating`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rating`
--
ALTER TABLE `rating`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
