INSERT INTO `rating` (`sid`, `product_sid`, `name`, `email`, `skin_type`, `rating`, `title`, `content`, `date`) 
VALUES (NULL, '1', 'ruby', 'ruby@gmail.com', '2', '5', '成分天然是最吸引我的地方', '卸妝力好, 洗後不緊繃, 易沖淨, 柔潤好推勻, 溫和低刺激, 不殘留, 洗後膚觸柔嫩', CURRENT_DATE()), 
(NULL, '1', 'Tom', 'Tom@gmail.com', '3', '5', '混合偏油也可以使用的卸妝乳', '一般卸妝的清潔力通常比較好，但對混合偏油肌的我來說非常容易造成毛孔堵塞形成粉刺或毛囊炎。但這款卸妝油使用時清爽舒適，容易洗淨；使用後毛孔呼吸很乾淨～！油肌福星～', CURRENT_DATE()),
 (NULL, '1', 'Allen', 'Allen@gmail.com', '1', '5', '天然ㄟ尚好', '總是困擾於找不到適合的卸妝產品，這瓶卸妝乳，出乎意料的好用，能夠把臉上的彩妝輕鬆的卸除，再搭艸艸洗面乳，完美清潔，不會讓肌膚造成負擔，屬於超敏感肌的我，終於找到適合的卸妝產品，放心的使用了，開心', CURRENT_DATE()), 
 (NULL, '1', 'Robin', 'Robin@gmail.com', '2', '5', '會回購', '一直以來（大約有10年）都是用其他牌的卸妝凝露，每次拿到各種卸妝乳的試用包都不會開封，最近用了順其自然卸妝乳的試用包（用量可以卸兩天），卸起來的感覺很舒服也很香（反而會讓我慢緩的好好卸裝），再搭配艸艸洗面乳，感受很棒，大概接下來１０年都會這麼使用艸艸的卸妝洗臉產品，激推！', CURRENT_DATE()), 
 (NULL, '1', '威廉', 'wii@gmail.com', '3', '5', '很好用', '針對日常淡妝好卸，卸完後肌膚覺得很舒服，已經使用好幾瓶了！', CURRENT_DATE()), 
 (NULL, '1', 'Mia', 'Mia@gmail.com', '2', '5', '喜歡', '用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜～', CURRENT_DATE()), 
(NULL, '1', '安安', 'anan@gmail.com', '1', '5', '比想像中厲害', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，和之前使用的經驗很不一樣，還會繼續使用艸艸卸妝油', CURRENT_DATE()), 
 (NULL, '1', 'Jerry', 'jerry@gmail.com', '2', '5', '很好用', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜', CURRENT_DATE()), 
(NULL, '1', 'Jerry', 'jerry@gmail.com', '3', '5', '會回購', '自己是混合偏油性肌，所以一直以來不太喜歡使用卸妝油，但艸艸的產品，使用後皮膚不油膩，也不乾澀，用完很舒服再搭配艸艸的洗面乳整個臉乾淨溜溜', CURRENT_DATE());